In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('../data_sets/oecd_tourism.csv',
                 usecols=['LOCATION', 'SUBJECT', 'TIME', 'Value'])

In [5]:
df.head()

  LOCATION  SUBJECT  TIME    Value
0      AUS  INT_REC  2008  31159.8
1      AUS  INT_REC  2009  29980.7
2      AUS  INT_REC  2010  35165.5
3      AUS  INT_REC  2011  38710.1
4      AUS  INT_REC  2012  38003.7

In [15]:
df.loc[df['SUBJECT']=='INT_REC'].groupby('LOCATION')['Value'].mean().sort_values(ascending=False).head()

LOCATION
USA    201613.500000
ESP     69655.817364
FRA     65063.335727
DEU     53408.570636
GBR     51752.090909
Name: Value, dtype: float64

In [17]:
df.loc[df['SUBJECT']=='INT-EXP'].groupby("LOCATION")['Value'].mean().sort_values().head()

LOCATION
MLT     387.801667
CRI     867.075000
LVA     919.545455
ISL    1072.819636
HRV    1115.628083
Name: Value, dtype: float64

In [41]:
df_3 = pd.read_csv('../data_sets/oecd_locations.csv',
                   header=None,
                   names=['LOCATION', 'NAME'],
                   index_col='LOCATION')
df_3.head()

               NAME
LOCATION
AUS       Australia
AUT         Austria
BEL         Belgium
CAN          Canada
DNK         Denmark

In [42]:
full_df = df_3.join(df.set_index('LOCATION'))
full_df.head()

               NAME  SUBJECT  TIME    Value
LOCATION
AUS       Australia  INT_REC  2008  31159.8
AUS       Australia  INT_REC  2009  29980.7
AUS       Australia  INT_REC  2010  35165.5
AUS       Australia  INT_REC  2011  38710.1
AUS       Australia  INT_REC  2012  38003.7

In [25]:
(full_df
 .loc[full_df['SUBJECT']=='INT_REC']
 .groupby('NAME')['Value']
 .mean()
 .sort_values(ascending=False)
 .head())

NAME
United States     201613.500000
France             65063.335727
Germany            53408.570636
United Kingdom     51752.090909
Italy              44930.211545
Name: Value, dtype: float64

In [26]:
(
    full_df
    .loc[full_df['SUBJECT'] == 'INT-EXP']
    .groupby('NAME')['Value']
    .mean()
    .sort_values()
    .head()
             
)

NAME
Hungary     2918.390182
Finland     5877.080909
Israel      6726.524833
Denmark    11326.169636
Austria    11934.563636
Name: Value, dtype: float64

# Beyond 1
### What happens if you perform the join in the other direction? That is, what if you invoke join on tourism_df, passing it an argument of locations_df? Do you get the same result?

In [33]:
df_3 = pd.read_csv('../data_sets/oecd_locations.csv',
                   header=None,
                   names=['LOCATION', 'NAME'],
                   index_col='LOCATION')

In [36]:
full_df_inverse = df.set_index('LOCATION').join(df_3)
full_df_inverse.head()
# The result is  the same

          SUBJECT  TIME    Value       NAME
LOCATION
AUS       INT_REC  2008  31159.8  Australia
AUS       INT_REC  2009  29980.7  Australia
AUS       INT_REC  2010  35165.5  Australia
AUS       INT_REC  2011  38710.1  Australia
AUS       INT_REC  2012  38003.7  Australia

# Beyond 2
### Get the mean tourism income per year rather than by country. Do you see any evidence of less tourism income during the time of the Great Recession, which started in 2008?

In [47]:
(full_df
 .loc[full_df['SUBJECT'] == 'INT_REC']
 .groupby('TIME')['Value']
 .mean()
 .sort_values(ascending=False)
  
 )

TIME
2019    62786.617333
2018    43185.853875
2017    40326.702250
2014    40043.334563
2016    39483.592062
2015    38912.695437
2013    37996.198750
2012    35628.632063
2011    34299.966375
2008    31757.065750
2010    30949.524125
2009    28505.886562
Name: Value, dtype: float64

# Beyond 3
### Reset the index on locations_df such that it has a (default) numeric index and two columns (LOCATION and NAME). Now run join on locations_df, specifying that you want to use the LOCATION column on the caller rather than its index. (The data frame passed as an argument to join will always be joined on its index.)

In [50]:
locations_df  = df_3.reset_index()

In [52]:
df = df.set_index('LOCATION')

In [53]:
join_df = locations_df.join(df, on='LOCATION')

In [55]:
join_df.set_index("LOCATION").head()

               NAME  SUBJECT  TIME    Value
LOCATION
AUS       Australia  INT_REC  2008  31159.8
AUS       Australia  INT_REC  2009  29980.7
AUS       Australia  INT_REC  2010  35165.5
AUS       Australia  INT_REC  2011  38710.1
AUS       Australia  INT_REC  2012  38003.7